app/controllers/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "世界史"], ["created_at", "2020-07-24 01:40:40.755650"], ["updated_at", "2020-07-24 01:40:40.755650"]]
---
  def create
    @genre = Genre.new(genre_params)

    if @genre.save

DELETE FROM "genres" WHERE "genres"."id" = $1  [["id", 2]]
---
  def destroy
    @genre.destroy

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_genre
    @genre = Genre.find(params[:id])