app/controllers/questions_controller.rb

  def show
    @Question = Question.find_by(id: params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("name", "accrual_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "せごどん蜂起"], ["accrual_date", "2020-05-24"], ["created_at", "2020-07-24 04:24:08.296642"], ["updated_at", "2020-07-24 04:24:08.296642"]]

  def update
    if @question.update(question_params)
---
UPDATE "questions" SET "accrual_date" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["accrual_date", "2020-07-24"], ["updated_at", "2020-07-24 04:25:53.862569"], ["id", 1]]